[
  {
    "title": "Union Minister for Health & Family Welfare addresses 2nd Health Working Group meeting under India's G20 Presidency",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1913175",
    "date": "2023-04-19",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "International Relations",
    "summary": "Dr. Mansukh Mandaviya highlighted India's focus on three health priorities under G20: health emergencies prevention and preparedness, strengthening cooperation for pharmaceutical sector, and digital health innovations. He emphasized the need for collaborative systems to ensure global health security and timely healthcare access in emergencies."
  },
  {
    "title": "Shri Mansukh Mandaviya holds bilateral meeting with delegations of UK",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1913119",
    "date": "2023-04-18",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "International Relations",
    "summary": "Health Minister Mansukh Mandaviya met with UK delegation to discuss strengthening bilateral health cooperation. The discussions focused on digital health innovations, medical education partnerships, and joint research initiatives to address emerging health challenges. Both nations committed to sharing best practices in healthcare delivery systems."
  },
  {
    "title": "Ministry of Health and Family Welfare reports 10,300 new COVID-19 cases",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912801",
    "date": "2023-04-16",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Disease Control",
    "summary": "The ministry reported 10,300 new COVID-19 cases with a recovery rate of 98.7%. Active cases remain at 0.3% of total infections. Over 220.65 crore vaccine doses have been administered nationwide. Weekly positivity rate stands at 5.51%, while daily positivity rate is 7.16%. Public advised to maintain COVID-appropriate behavior."
  },
  {
    "title": "Union Government committed to ensuring healthcare for all: Shri J.P. Nadda",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912672",
    "date": "2023-04-15",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Healthcare Policy",
    "summary": "Union Minister J.P. Nadda reaffirmed the government's commitment to universal healthcare access. He highlighted achievements including the expansion of health infrastructure in rural areas, increased medical colleges, and implementation of Ayushman Bharat. The minister emphasized that healthcare initiatives now focus on preventive and promotive approaches rather than just curative care."
  },
  {
    "title": "National Medical Commission issues new guidelines for MBBS admissions",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912503",
    "date": "2023-04-14",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Medical Education",
    "summary": "The National Medical Commission released revised guidelines for MBBS admissions to streamline the process and ensure merit-based selection. Key changes include standardized entrance examination protocols, transparency measures in counseling procedures, and provisions for students from economically weaker sections. These guidelines aim to improve the quality of medical education across India."
  },
  {
    "title": "Ayushman Bharat Digital Mission crosses 40 crore registered health records",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912402",
    "date": "2023-04-13",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Digital Health",
    "summary": "The Ayushman Bharat Digital Mission has reached a milestone of 40 crore registered health records. This digital health ecosystem features unique health IDs, healthcare professional registries, and health facility registries. The initiative enables secure storage and exchange of health information, empowering citizens with portable electronic health records and facilitating telemedicine services."
  },
  {
    "title": "Union Health Ministry launches nationwide awareness campaign on maternal health",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912300",
    "date": "2023-04-12",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Maternal & Child Health",
    "summary": "The Health Ministry initiated a comprehensive awareness campaign targeting maternal health improvements across India. The initiative focuses on prenatal care, institutional deliveries, nutritional guidance, and post-natal support. Community health workers will conduct door-to-door visits in rural areas to educate expectant mothers about available government services and proper maternal healthcare practices."
  },
  {
    "title": "Government to establish 22 new AIIMS across the country",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912201",
    "date": "2023-04-11",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Health Infrastructure",
    "summary": "The government announced plans to establish 22 new AIIMS (All India Institute of Medical Sciences) facilities nationwide to strengthen tertiary healthcare infrastructure. This expansion aims to reduce regional disparities in healthcare access and quality. Each new institute will feature state-of-the-art medical facilities, research centers, and educational capabilities to serve as regional centers of excellence."
  },
  {
    "title": "Mental Healthcare Act implementation review shows positive outcomes",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912100",
    "date": "2023-04-10",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Mental Health",
    "summary": "A review of the Mental Healthcare Act implementation reveals significant improvements in mental health services nationwide. Achievements include establishment of Mental Health Review Boards in all states, increased registration of mental health professionals, and reduced stigmatization. The Act has strengthened rights-based approaches to mental healthcare and promoted dignified treatment for patients."
  },
  {
    "title": "National Tuberculosis Elimination Programme achieves 25% reduction in TB cases",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=1912050",
    "date": "2023-04-09",
    "ministry": "Ministry of Health and Family Welfare",
    "category": "Disease Control",
    "summary": "The National Tuberculosis Elimination Programme reports a 25% reduction in TB cases over the past three years. Success factors include active case finding initiatives, improved diagnostic capabilities, and patient support programs like Nikshay Poshan Yojana. The program has implemented cutting-edge molecular diagnostics and shorter treatment regimens, moving India closer to its goal of TB elimination by 2025."
  }
]
