[
  {
    "title": "Steps taken by the Government to increase surveillance and awareness of Antimicrobial Resistance (AMR)",
    "date": "28 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2116222",
    "category": "Antimicrobial-Resistance (AMR)",
    "content": "The Government has implemented comprehensive measures to combat Antimicrobial Resistance including enhanced surveillance systems, awareness campaigns for healthcare professionals and the public, and stricter regulations on antibiotic prescriptions. The National Action Plan on AMR coordinates efforts across sectors with regular monitoring of resistance patterns in healthcare facilities."
  },
  {
    "title": "Steps taken by the Government of India to maintain quality of education in pharmacy sector",
    "date": "28 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2116221",
    "category": "Pharmaceuticals",
    "content": "The Government has strengthened pharmacy education quality through curriculum updates, mandatory accreditation of institutions, faculty development programs, and digital learning initiatives. The Pharmacy Council of India is enforcing stricter compliance with educational standards and promoting industry collaborations to ensure graduates are industry-ready with practical skills and theoretical knowledge."
  },
  {
    "title": "Update on National Quality Assurance Standards (NQAS)",
    "date": "28 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2116213",
    "category": "Health Systems and Infrastructure",
    "content": "The National Quality Assurance Standards implementation has shown significant progress with certification of over 14,000 healthcare facilities nationwide. These standards have improved service delivery, patient safety, and satisfaction across public healthcare institutions. The certification process involves rigorous assessment of facilities against standardized parameters covering clinical care, patient rights, and support services."
  },
  {
    "title": "Update on Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (AB PM-JAY)",
    "date": "28 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2116209",
    "category": "Health Systems and Infrastructure",
    "content": "The Ayushman Bharat PM-JAY scheme has now provided health coverage to over 120 million families, with approximately 52 million hospital admissions worth ₹65,000 crores. Recent enhancements include expanded treatment packages, improved claim settlement processes, and integration with state health insurance schemes. The program continues to focus on reaching underserved populations and improving service quality."
  },
  {
    "title": "National Consultation on Adolescent Nutrition: Let's Fix Our Food (LFOF) Consortium convened at Indian Council of Medical Research (ICMR)",
    "date": "28 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2116146",
    "category": "Others",
    "content": "ICMR hosted the National Consultation on Adolescent Nutrition bringing together experts to address nutritional challenges facing Indian youth. The Let's Fix Our Food Consortium introduced evidence-based strategies to combat micronutrient deficiencies and promote healthy eating habits among adolescents. The initiative aims to develop targeted interventions considering regional dietary patterns and socioeconomic factors affecting adolescent nutrition."
  },
  {
    "title": "Union Health Ministry Releases National Guidelines on Medical Oxygen Management",
    "date": "27 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2115648",
    "category": "Others",
    "content": "The Health Ministry has released comprehensive guidelines for medical oxygen management to ensure efficient and safe oxygen administration in healthcare settings. The guidelines cover infrastructure requirements, technical specifications, procurement procedures, storage protocols, and training modules for healthcare workers. This initiative aims to prevent oxygen shortages during emergencies and standardize oxygen therapy practices nationwide."
  },
  {
    "title": "Measures taken to reduce healthcare costs",
    "date": "25 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114761",
    "category": "Others",
    "content": "The government has implemented multiple cost-reduction measures including price caps on essential medicines and medical devices, promotion of generic medications through Jan Aushadhi stores, standardization of treatment protocols, and expansion of public health insurance coverage. These initiatives have significantly lowered out-of-pocket expenditure for patients while ensuring quality of care is maintained."
  },
  {
    "title": "Update on Ayushman Arogya Mandir",
    "date": "25 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114759",
    "category": "Others",
    "content": "Ayushman Arogya Mandir has expanded to over 1.5 lakh centers nationwide, providing primary healthcare services to rural and underserved communities. These centers offer comprehensive preventive and curative services, telemedicine consultations, and essential diagnostics. Recent data shows they've conducted over 120 million teleconsultations and delivered free medications to approximately 85 million patients in the last year."
  },
  {
    "title": "Steps taken on Mental Health",
    "date": "25 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114756",
    "category": "Non-Communicable Diseases",
    "content": "The government has strengthened mental healthcare through the National Mental Health Program with increased budgetary allocation, establishment of new mental health facilities, and training of primary healthcare workers in mental health screening. A nationwide mental health helpline has been launched, along with public awareness campaigns to reduce stigma and promote early intervention for mental health conditions."
  },
  {
    "title": "Steps taken to expand healthcare professionals in rural areas",
    "date": "25 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114753",
    "category": "Others",
    "content": "To address healthcare professional shortages in rural areas, the government has introduced rural service incentives, mandatory rural postings for medical graduates, increased MBBS seats with rural service bonds, and enhanced allowances for rural healthcare workers. Community health worker programs have been expanded, along with digital health initiatives to enable telemedicine support for rural practitioners."
  },
  {
    "title": "ICMR Pioneers Drone-Based Cornea Transport to Revolutionize Eye Care",
    "date": "25 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114748",
    "category": "Medical Technologies",
    "content": "ICMR has successfully implemented drone technology for transporting corneal tissues across challenging terrains, significantly reducing delivery time from hours to minutes. This innovation ensures viability of transplant materials and improves access to sight-saving surgeries in remote areas. The pilot program has achieved a 95% success rate in timely deliveries and will be expanded to 20 additional locations this year."
  },
  {
    "title": "Union Health Minister Shri JP Nadda Inaugurates World TB Day 2025 Summit",
    "date": "24 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114554",
    "category": "Infectious Diseases",
    "content": "Health Minister JP Nadda inaugurated the World TB Day 2025 Summit highlighting India's progress toward TB elimination by 2025. The event showcased achievements including a 20% reduction in TB incidence over the past three years, improved diagnostics coverage, and successful implementation of community engagement programs. New initiatives announced include expanded molecular testing facilities and enhanced nutritional support for TB patients."
  },
  {
    "title": "World Tuberculosis (TB) Day – 2025",
    "date": "24 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2114549",
    "category": "Infectious Diseases",
    "content": "World TB Day 2025 was observed with the theme 'Invest to End TB. Save Lives.' emphasizing the need for sustained funding to eliminate tuberculosis. The Ministry outlined achievements including detection of over 3 million TB cases in the past year and treatment success rates exceeding 85%. The National TB Elimination Program has expanded its network of testing laboratories and strengthened patient support systems nationwide."
  },
  {
    "title": "Saving Mothers, Strengthening Futures",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113800",
    "category": "Maternal and Child Health",
    "content": "The 'Saving Mothers, Strengthening Futures' initiative reports significant progress in reducing maternal mortality across India through improved access to antenatal care, skilled birth attendance, and emergency obstetric services. The program has trained over 50,000 healthcare workers in maternal care protocols and established 1,200 specialized maternal health centers in high-priority districts, resulting in a 15% reduction in maternal deaths over two years."
  },
  {
    "title": "President of India, Smt. Droupadi Murmu Addresses 49th Annual Convocation of All India Institute of Medical Sciences, New Delhi",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113793",
    "category": "Others",
    "content": "President Droupadi Murmu addressed AIIMS graduates emphasizing their crucial role in advancing healthcare access and quality across India. She highlighted the importance of combining scientific excellence with compassion and urged the new medical professionals to consider service in underserved areas. The President also acknowledged AIIMS' contributions to medical research and education in addressing the country's health challenges."
  },
  {
    "title": "Update on bio-safety laboratories in the country",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113685",
    "category": "Research and Development",
    "content": "India has significantly expanded its network of bio-safety laboratories with 15 BSL-3 and 2 BSL-4 facilities now operational nationwide. These laboratories adhere to international safety standards for handling high-risk pathogens and have enhanced the country's capability for outbreak investigation and infectious disease research. Recent investments have focused on upgrading infrastructure, training specialized personnel, and implementing advanced biosecurity protocols."
  },
  {
    "title": "Measures taken by the government to use AI in the public health system",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113683",
    "category": "Public Health",
    "content": "The government has launched multiple AI initiatives in public health including predictive analytics for disease outbreaks, AI-powered diagnostic tools in primary healthcare centers, and machine learning algorithms for analyzing health data patterns. The National Digital Health Mission now incorporates AI for personalized health recommendations, while an AI-driven telemedicine platform connects remote areas with specialists. These technologies have improved early disease detection and resource allocation efficiency."
  },
  {
    "title": "Steps taken by the Government to ensure quality standards of food products",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113681",
    "category": "Food Safety",
    "content": "The Government has strengthened food safety measures through updated Food Safety and Standards regulations, increased testing laboratories, and digital tracking systems for food products. FSSAI has enhanced its surveillance network with over 5,000 food safety officers conducting regular inspections nationwide. A consumer awareness campaign on food safety has reached millions through digital and traditional media, empowering consumers to make informed food choices."
  },
  {
    "title": "Steps taken by the Government to expand healthcare infrastructure",
    "date": "21 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2113679",
    "category": "Health Systems and Infrastructure",
    "content": "The Government has made significant strides in healthcare infrastructure expansion with the establishment of 22 new AIIMS, upgrade of district hospitals, and development of critical care units in over 600 districts. Additional medical colleges have increased MBBS seats by 30%, while digital health infrastructure has connected 150,000 health facilities nationwide through the Ayushman Bharat Digital Mission, improving service delivery and patient record management."
  },
  {
    "title": "Update on elimination of Trachoma and Malaria",
    "date": "18 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2112480",
    "category": "Infectious Diseases",
    "content": "India has made remarkable progress toward eliminating trachoma and malaria with 32 states now declared trachoma-free and malaria cases reduced by 86% since 2015. The National Framework for Malaria Elimination has successfully implemented targeted vector control measures, early diagnosis protocols, and community surveillance systems. For trachoma, comprehensive eye care services have been extended to previously endemic regions with antibiotics distribution and hygiene promotion programs."
  },
  {
    "title": "Steps taken under TB-Mukt Bharat Abhiyan",
    "date": "18 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2112478",
    "category": "Infectious Diseases",
    "content": "The TB-Mukt Bharat Abhiyan has accelerated tuberculosis elimination efforts through active case finding initiatives covering over 500 million citizens, adoption of advanced molecular diagnostics, and community engagement programs with 200,000 TB champions. The initiative has enrolled 3 million TB patients in the direct benefit transfer program providing nutritional support, while private sector engagement has increased case notifications by 35% in the past year."
  },
  {
    "title": "Update on Maternal and Child Health Indicators under NHM",
    "date": "18 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2112476",
    "category": "Maternal and Child Health",
    "content": "The National Health Mission reports significant improvements in maternal and child health indicators with institutional deliveries increasing to 92%, full immunization coverage reaching 89%, and neonatal mortality declining by 15% over three years. The LaQshya initiative has certified 850 labor rooms for quality care, while Janani Suraksha Yojana has benefited over 25 million women through financial incentives for institutional deliveries in the past five years."
  },
  {
    "title": "Union Minister of State for Health and Family Welfare, Smt. Anupriya Patel inaugurates the India Innovation Summit – Pioneering Solutions to End TB",
    "date": "18 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2112158",
    "category": "Infectious Diseases",
    "content": "Minister Anupriya Patel inaugurated the India Innovation Summit showcasing cutting-edge technologies to combat tuberculosis. The event featured AI-based diagnostic tools, digital adherence technologies, and novel treatment regimens developed by Indian researchers and startups. The government announced a ₹500 crore innovation fund to accelerate development and deployment of TB solutions as part of the mission to eliminate TB by 2025."
  },
  {
    "title": "Union Minister of State for Health and Family Welfare, Smt. Anupriya Patel inaugurates QUAD Workshop on Pandemic Preparedness for Indo-Pacific Region",
    "date": "17 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2111705",
    "category": "Infectious Diseases",
    "content": "Minister Anupriya Patel inaugurated the QUAD Workshop on Pandemic Preparedness focusing on strengthening regional response capabilities for emerging infectious diseases. The collaborative initiative between India, Australia, Japan, and the United States aims to enhance disease surveillance systems, laboratory networks, and emergency response protocols across the Indo-Pacific region. The workshop established a joint task force for coordinated action during future outbreaks."
  },
  {
    "title": "Update on "75/25" Initiative",
    "date": "11 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2110390",
    "category": "Health Systems and Infrastructure",
    "content": "The "75/25" Initiative to reduce healthcare costs has successfully implemented price controls on 75% of essential medicines and 25% reduction in diagnostic test costs across public hospitals. The program has benefited over 50 million patients with average out-of-pocket expenditure decreasing by 30%. Additional components include bulk procurement systems for medical supplies and incentives for hospitals adopting standardized treatment protocols to minimize unnecessary procedures."
  },
  {
    "title": "Steps taken to prioritize Research on Fungal Infections",
    "date": "11 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2110387",
    "category": "Infectious Diseases",
    "content": "The government has established a dedicated National Center for Fungal Disease Research with ₹200 crore funding to address rising concerns about fungal infections. Research priorities include developing affordable diagnostics, exploring novel antifungal compounds, and understanding epidemiological patterns of fungal diseases. A national surveillance network now monitors fungal infection trends across 75 sentinel centers, with particular focus on immunocompromised patient populations."
  },
  {
    "title": "Update on National Ambulance Services (NAS) Scheme",
    "date": "11 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2110385",
    "category": "Health Systems and Infrastructure",
    "content": "The National Ambulance Services scheme has expanded to 15,000 ambulances nationwide with advanced life support capabilities in 35% of the fleet. GPS tracking and centralized dispatch systems have reduced emergency response times to under 15 minutes in urban areas and 25 minutes in rural regions. The service responds to approximately 30,000 calls daily with specialized training for emergency medical technicians and standardized protocols for different medical emergencies."
  },
  {
    "title": "Steps taken to treat cases of Cancer, emanating from Cancer-Causing Rivers",
    "date": "11 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2110384",
    "category": "Non-Communicable Diseases",
    "content": "The government has initiated comprehensive measures to address cancer cases in regions with polluted rivers, including specialized cancer screening camps in affected areas, establishing five dedicated cancer treatment centers in high-risk zones, and launching environmental remediation projects. A multi-disciplinary research team is investigating links between specific pollutants and cancer patterns, while affected patients receive priority treatment under the Pradhan Mantri Jan Arogya Yojana health insurance scheme."
  },
  {
    "title": "Union Minister of Health and Family Welfare, Shri JP Nadda virtually presides over the 48th Annual Day Celebration of NIHFW, in the presence of Union Minister of State for Health and Family Welfare, Smt. Anupriya Patel",
    "date": "09 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2109624",
    "category": "Others",
    "content": "Health Minister JP Nadda presided over the National Institute of Health and Family Welfare's 48th Annual Day, highlighting its contributions to public health capacity building and policy implementation. NIHFW has trained over 12,000 healthcare professionals in the past year and launched new programs in health systems management and digital health. The Minister announced expanded research initiatives and international collaborations to strengthen NIHFW's role in advancing public health practices."
  },
  {
    "title": "Union Health Minister Shri JP Nadda inaugurates third International Symposium on Health Technology Assessment 2025",
    "date": "08 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2109392",
    "category": "Medical Technologies",
    "content": "Health Minister JP Nadda inaugurated the International Symposium on Health Technology Assessment focusing on evidence-based decision making for healthcare interventions and technologies. The event brought together experts from 30 countries to share best practices in evaluating cost-effectiveness and clinical benefits of medical technologies. India announced the expansion of its HTA India network to all states for systematic assessment of healthcare technologies before widespread adoption."
  },
  {
    "title": "Union Health Minister Shri Jagat Prakash Nadda Reviews AIIMS Bilaspur's Milestones and Development Progress",
    "date": "07 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2109307",
    "category": "Health Systems and Infrastructure",
    "content": "Health Minister JP Nadda reviewed AIIMS Bilaspur's progress, noting completion of major infrastructure including 750-bed hospital, academic blocks, and residential complexes. The institute has initiated 42 specialty departments and conducts 2,500 daily outpatient consultations. Recent additions include robotic surgery facilities, a regional trauma center, and telemedicine services connecting 50 district hospitals. The Minister announced plans for a cancer research center within the campus."
  },
  {
    "title": "Prime Minister Shri Narendra Modi addresses the Post-Budget Webinar on the theme 'Investing in People'",
    "date": "05 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2108672",
    "category": "Others",
    "content": "Prime Minister Modi addressed the Post-Budget Webinar highlighting increased healthcare allocations and the government's focus on human capital development through health and education investments. He emphasized the importance of preventive healthcare, skill development for healthcare workers, and leveraging technology to extend medical services to remote areas. The PM outlined plans for integrated health data systems and public-private partnerships to strengthen healthcare infrastructure."
  },
  {
    "title": "Union Health Minister Shri JP Nadda chairs 9th meeting of Mission Steering Group for National Health Mission",
    "date": "04 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2108121",
    "category": "Health Systems and Infrastructure",
    "content": "Health Minister JP Nadda chaired the National Health Mission's Mission Steering Group meeting approving an annual budget of ₹40,000 crore for strengthening primary healthcare systems nationwide. Key decisions included expanding the ASHA worker program by 200,000 positions, establishing 3,500 new Health and Wellness Centers, and enhancing disease surveillance capabilities across states. The meeting also reviewed progress on maternal and child health indicators showing steady improvement over the past year."
  },
  {
    "title": "Union Health Minister Shri JP Nadda visits Rural Health Training Center, Najafgarh and Ayushman Arogya Mandir, Palam; interacts with Patients and Medical Staff",
    "date": "03 Mar 2025",
    "link": "https://pib.gov.in/PressReleasePage.aspx?PRID=2107742",
    "category": "Health Systems and Infrastructure",
    "content": "Health Minister JP Nadda visited healthcare facilities in Delhi's peripheral areas, interacting with patients and staff at the Rural Health Training Center in Najafgarh and Ayushman Arogya Mandir in Palam. He reviewed services including teleconsultations, diagnostic facilities, and medicine distribution systems. The Minister announced additional funding for upgrading medical equipment and expanding services at these centers which collectively serve over 5,000 patients daily."
  }
]
